SOAP Test Application/Templates/EWS/CopyFolder.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <CopyFolder xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
      <ToFolderId>
        <!--FIELD:ToFolderId;FolderId-->
      </ToFolderId>
      <FolderIds>
        <!--FIELD:FolderId;FolderId-->
      </FolderIds>
    </CopyFolder>
  </soap:Body>
</soap:Envelope>